fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоровИСсылокНаРеализацию</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <comment>Очищены параметры выбора: вид договора: Покупатель (Иконникова К.Ю.)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <comment>ВКМ в Тип добавлен ДоговорыКонтрагентов</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция УзнатьНеСозданныеЗаПериодДокументы(НачалоПериода, ОкончаниеПериода)
	
		Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Организация,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
	|		И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И (ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора >= &КонецПериода
	|	И &НачалоПериода >= ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора)
	|	И РеализацияТоваровУслуг.Дата ЕСТЬ NULL";
		
	
	СсылкаПустая = Документы.РеализацияТоваровУслуг.ПустаяСсылка(); 
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("СсылкаПустая", СсылкаПустая);
	Запрос.УстановитьПараметр("КонецПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;

КонецФункции

Функция УзнатьСозданныеЗаПериодДокументы(НачалоПериода, ОкончаниеПериода)
	
		Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Организация,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	|	РеализацияТоваровУслуг.Дата КАК ДатаРеализации
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
	|		И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И РеализацияТоваровУслуг.Дата ЕСТЬ НЕ NULL";
		
	
	СсылкаПустая = Документы.РеализацияТоваровУслуг.ПустаяСсылка(); 
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("СсылкаПустая", СсылкаПустая);
	Запрос.УстановитьПараметр("КонецПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;

КонецФункции
	
Функция ВыполнитьДлитедьноеДействие(НачалоПериода, ОкончаниеПериода) Экспорт
	
	Если ТекущаяДатаСеанса() >= ОкончаниеПериода Тогда
		
		ТекущийПериод = НачалоПериода;
		Пока ТекущийПериод <= ОкончаниеПериода Цикл
		    ТекДатаНачала = Макс(НачалоПериода, НачалоМесяца(ТекущийПериод));
		    ТекДатаОкончания = Мин(ОкончаниеПериода, КонецМесяца(ТекущийПериод));
		    ТекущийПериод = ДобавитьМесяц(ТекущийПериод, 1);

			//@skip-check query-in-loop
			РезультатЗапроса = УзнатьНеСозданныеЗаПериодДокументы(ТекДатаНачала, ТекДатаОкончания);
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		
			Счетчик = 1;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
					
				ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				//@skip-check use-non-recommended-method
				//@skip-check use-non-recommended-method
				ДокументРеализация.Дата = ТекДатаОкончания;
				ДокументРеализация.Организация = ВыборкаДетальныеЗаписи.Организация;
				ДокументРеализация.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
				ДокументРеализация.Договор = ВыборкаДетальныеЗаписи.Договор;
				ДокументРеализация.ВКМ_ВыполнитьАвтозаполнение(ВыборкаДетальныеЗаписи.Договор);
				
				Если ДокументРеализация.ПроверитьЗаполнение() Тогда
					// Проводятся только корректно заполненные
				    ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);    	
				КонецЕсли;
						
				ДлительныеОперации.СообщитьПрогресс(Счетчик / ВыборкаДетальныеЗаписи.Количество() * 100);
				
				Счетчик = Счетчик + 1;
				
			КонецЦикла;
			
		КонецЦикла;
		
		РезультатЗапросаДокументов = УзнатьСозданныеЗаПериодДокументы(НачалоПериода, ОкончаниеПериода);
		
		ВсеСозданныеДокументы = РезультатЗапросаДокументов.Выгрузить();	
		
		ВозвращаемоеСообщение = СтрШаблон("Документы 'Реализация товаров и услуг' созданы и проведены за период с %1 по %2",
			Формат(НачалоПериода, "ДЛФ=Д"), Формат(ОкончаниеПериода, "ДЛФ=Д"));
			
		ВозврашаемыйОтвет = Новый Структура;
		ВозврашаемыйОтвет.Вставить("ВозвращаемоеСообщение", ВозвращаемоеСообщение);
		ВозврашаемыйОтвет.Вставить("ВсеСозданныеДокументы", ВсеСозданныеДокументы);
	
	Иначе
		ВозврашаемыйОтвет = Новый Структура;
		ВозвращаемоеСообщение = СтрШаблон("Документы 'Реализация товаров и услуг' не созданы за выбранный период с %1 по %2.
		| Дата окончания периода %2 больше текущей.",
			Формат(НачалоПериода, "ДЛФ=Д"), Формат(ОкончаниеПериода, "ДЛФ=Д"));
		ВозврашаемыйОтвет.Вставить("ВозвращаемоеСообщение", ВозвращаемоеСообщение);
		ВозврашаемыйОтвет.Вставить("ВсеСозданныеДокументы", Неопределено);
	
	КонецЕсли;
	
	Возврат ВозврашаемыйОтвет;

КонецФункции

#КонецОбласти

#КонецЕсли
